lab11_ci/ci4/app/Controllers/Ajax.php

SELECT *
FROM `artikel`
---
    public function getData()
    {
        $model = new ArtikelModel();
        $data  = $model->findAll();